### Manipulação de dados ausentes

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A': [1,2,np.nan],
                   'B': [5,np.nan,np.nan],
                   'C': [1,2,3]})

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [9]:
df.fillna('Conteúdo')

          A         B  C
0       1.0       5.0  1
1       2.0  Conteúdo  2
2  Conteúdo  Conteúdo  3

In [10]:
df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3